# BuiltInFailures.MirrorFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..MirrorFailures Members
BuiltInFailures..::..MirrorFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..MirrorFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BadMirror | Can't mirror element into this position. |

# See Also
BuiltInFailures..::..MirrorFailures Class
Autodesk.Revit.DB Namespace